In [1]:
# To install the library
# ! pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.12/site-packages (from pandasql) (1.26.4)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (from pandasql) (2.2.2)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (from pandasql) (2.0.30)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas->pandasql) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas->pandasql) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy->pandasql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26771 sha256=74b1781028aa4f6b067162afbe2ab18340a100ec84ab84649ab3f9024a901454
  Stored in directory: /Users/zehrayilmaz/Library/Caches/pip/wheels/15/a1/e7/6f92f295b5272ae5c02365e6b8fa19cb93f16a537090a1cf27
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [5]:
import pandas as pd
from pandasql import sqldf

In [7]:
nyc_data_sep = pd.read_csv("./nyc_sample_data_for_sql_sep_2015.csv")
nyc_data_oct = pd.read_csv("./nyc_sample_data_for_sql_oct_2015.csv")

In [9]:
nyc_data_sep.columns

Index(['VendorID', 'lpep_pickup_datetime', 'Lpep_dropoff_datetime',
       'Store_and_fwd_flag', 'RateCodeID', 'Pickup_longitude',
       'Pickup_latitude', 'Dropoff_longitude', 'Dropoff_latitude',
       'Passenger_count', 'Trip_distance', 'Fare_amount', 'Extra', 'MTA_tax',
       'Tip_amount', 'Tolls_amount', 'Ehail_fee', 'improvement_surcharge',
       'Total_amount', 'Payment_type', 'Trip_type ', 'lpep_pickup_hour',
       'lpep_pickup_day_of_week', 'trip_id', 'driver_id'],
      dtype='object')

In [11]:
nyc_data_sep.head(5)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id
0,2,2015-09-01 01:17:11,2015-09-01 01:23:01,N,1,-73.830284,40.759506,-73.813698,40.751537,2,...,0.0,NaN,0.3,7.80,2,1.0,1,Tuesday,1,2
1,2,2015-09-01 02:01:29,2015-09-01 02:22:58,N,1,-73.955322,40.720055,-73.906677,40.684845,1,...,0.0,NaN,0.3,22.56,1,1.0,2,Tuesday,2,2
2,2,2015-09-01 04:28:56,2015-09-01 04:28:58,N,5,0.000000,0.000000,-73.939354,40.788391,1,...,0.0,NaN,0.0,15.00,1,2.0,4,Tuesday,3,3
3,2,2015-09-01 06:56:55,2015-09-01 06:59:09,N,1,-73.914764,40.763802,-73.921127,40.766788,1,...,0.0,NaN,0.3,5.38,1,1.0,6,Tuesday,4,5
4,2,2015-09-01 07:54:44,2015-09-01 07:57:07,N,1,-73.894241,40.864166,-73.897781,40.870739,1,...,0.0,NaN,0.3,6.24,1,1.0,7,Tuesday,5,2

In [13]:
## Test query
# Just put your query into the value q and put this as a parameter into sqldf function.
q = """
        SELECT * 
        FROM nyc_data_sep
        LIMIT 5;
    """

sqldf(q)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id
0,2,2015-09-01 01:17:11,2015-09-01 01:23:01,N,1,-73.830284,40.759506,-73.813698,40.751537,2,...,0.0,None,0.3,7.80,2,1.0,1,Tuesday,1,2
1,2,2015-09-01 02:01:29,2015-09-01 02:22:58,N,1,-73.955322,40.720055,-73.906677,40.684845,1,...,0.0,None,0.3,22.56,1,1.0,2,Tuesday,2,2
2,2,2015-09-01 04:28:56,2015-09-01 04:28:58,N,5,0.000000,0.000000,-73.939354,40.788391,1,...,0.0,None,0.0,15.00,1,2.0,4,Tuesday,3,3
3,2,2015-09-01 06:56:55,2015-09-01 06:59:09,N,1,-73.914764,40.763802,-73.921127,40.766788,1,...,0.0,None,0.3,5.38,1,1.0,6,Tuesday,4,5
4,2,2015-09-01 07:54:44,2015-09-01 07:57:07,N,1,-73.894241,40.864166,-73.897781,40.870739,1,...,0.0,None,0.3,6.24,1,1.0,7,Tuesday,5,2

In [15]:
q = """
        SELECT RateCodeID 
        FROM nyc_data_sep
        LIMIT 5;
    """

sqldf(q)

   RateCodeID
0           1
1           1
2           5
3           1
4           1

In [17]:
print (q)

        SELECT RateCodeID
        FROM nyc_data_sep
        LIMIT 5;

In [25]:
 #  1. Most expensive trip (total amount).
q = """
        SELECT total_amount 
        FROM nyc_data_sep
        ORDER BY total_amount DESC
        LIMIT 1;
    """

sqldf(q)

   Total_amount
0        136.36

In [27]:
q = """
        SELECT * 
        FROM nyc_data_sep
        ORDER BY total_amount DESC
        LIMIT 1;
    """

sqldf(q)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id
0,2,2015-09-13 16:08:43,2015-09-13 16:53:13,N,3,-73.945396,40.719357,-74.177361,40.695236,1,...,22.83,None,0.3,136.36,1,1.0,16,Sunday,637,1

In [33]:
q = """
        SELECT MAX(total_amount) 'max total amount'
        FROM nyc_data_sep
        
    """

sqldf(q)

   max total amount
0            136.36

In [35]:
nyc_data_sep.columns

Index(['VendorID', 'lpep_pickup_datetime', 'Lpep_dropoff_datetime',
       'Store_and_fwd_flag', 'RateCodeID', 'Pickup_longitude',
       'Pickup_latitude', 'Dropoff_longitude', 'Dropoff_latitude',
       'Passenger_count', 'Trip_distance', 'Fare_amount', 'Extra', 'MTA_tax',
       'Tip_amount', 'Tolls_amount', 'Ehail_fee', 'improvement_surcharge',
       'Total_amount', 'Payment_type', 'Trip_type ', 'lpep_pickup_hour',
       'lpep_pickup_day_of_week', 'trip_id', 'driver_id'],
      dtype='object')

In [45]:
  # 2. Most expensive trip per mile (Total_amount/Trip_distance).
q = """
        SELECT *, (Total_amount/Trip_distance) as cost_per_mile
        FROM nyc_data_sep
        ORDER BY cost_per_mile DESC
        LIMIT 1;
    """
sqldf(q)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id,cost_per_mile
0,2,2015-09-24 08:58:39,2015-09-24 08:58:47,N,2,-73.937447,40.848503,-73.937325,40.848621,1,...,None,0.3,52.8,2,1.0,8,Thursday,1147,5,5280.0

In [49]:
q = """
        SELECT MAX (Total_amount/Trip_distance) as cost_per_mile
        FROM nyc_data_sep
        
    """
sqldf(q)

   cost_per_mile
0         5280.0

In [53]:
 #  3. Most generous trip (highest tip).

q = """
        SELECT *
        FROM nyc_data_sep
        ORDER BY Tip_amount DESC
        LIMIT 1;
    """
sqldf(q)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id
0,1,2015-09-02 23:43:21,2015-09-02 23:44:04,N,5,-73.956963,40.66954,-73.955902,40.668324,1,...,0.0,None,0.0,45.8,1,2.0,23,Wednesday,65,3

In [55]:
q = """
        SELECT MAX (Tip_amount) 
        FROM nyc_data_sep
        
    """
sqldf(q)

   MAX (Tip_amount)
0              45.8

In [63]:
 # 4. Longest trip duration.
 # strftime



q = """
        SELECT (CAST(strftime('%s', Lpep_dropoff_datetime) as integer)-CAST(strftime('%s', Lpep_pickup_datetime) as integer)) as trip_duration
        FROM nyc_data_sep
        ORDER BY trip_duration DESC
        LIMIT 1;
    """
sqldf(q)

   trip_duration
0          85279

In [16]:
#    5. Mean tip by hour.
q = """
        SELECT lpep_pickup_hour, Avg(Tip_amount) 
        FROM nyc_data_sep
        group by lpep_pickup_hour
        order by 1 
        
        
    """
sqldf(q)

    lpep_pickup_hour  Avg(Tip_amount)
0                  0         1.213387
1                  1         1.446349
2                  2         0.637097
3                  3         0.810741
4                  4         1.152903
5                  5         0.141818
6                  6         0.903333
7                  7         1.282889
8                  8         1.461270
9                  9         1.443784
10                10         1.103774
11                11         0.791406
12                12         1.002414
13                13         1.367097
14                14         0.999167
15                15         1.231507
16                16         1.612055
17                17         1.332444
18                18         1.307327
19                19         0.977500
20                20         1.387500
21                21         1.287527
22                22         1.770500
23                23         1.983864

In [8]:
nyc_data_sep[['Tip_amount','lpep_pickup_hour']].head()

   Tip_amount  lpep_pickup_hour
0        0.00                 1
1        3.76                 2
2        0.00                 4
3        1.08                 6
4        1.44                 7

In [7]:
nyc_data_sep.columns

Index(['VendorID', 'lpep_pickup_datetime', 'Lpep_dropoff_datetime',
       'Store_and_fwd_flag', 'RateCodeID', 'Pickup_longitude',
       'Pickup_latitude', 'Dropoff_longitude', 'Dropoff_latitude',
       'Passenger_count', 'Trip_distance', 'Fare_amount', 'Extra', 'MTA_tax',
       'Tip_amount', 'Tolls_amount', 'Ehail_fee', 'improvement_surcharge',
       'Total_amount', 'Payment_type', 'Trip_type ', 'lpep_pickup_hour',
       'lpep_pickup_day_of_week', 'trip_id', 'driver_id'],
      dtype='object')

In [17]:
q = """
        SELECT   strftime('%H', Lpep_dropoff_datetime) as hour , Avg(Tip_amount) 
        FROM nyc_data_sep
        group by hour
        order by 1 
        
    """
sqldf(q)

   hour  Avg(Tip_amount)
0    00         1.368611
1    01         1.393621
2    02         0.884186
3    03         0.834583
4    04         0.940909
5    05         0.817500
6    06         0.782917
7    07         1.165455
8    08         1.097500
9    09         1.448493
10   10         1.506607
11   11         0.929153
12   12         0.834828
13   13         1.168636
14   14         1.186935
15   15         1.097015
16   16         1.421831
17   17         1.319579
18   18         1.395937
19   19         1.185000
20   20         1.202333
21   21         1.425543
22   22         1.359036
23   23         2.369767

   7. Average total trip by day of week (Fortunately, we have day of week information. Otherwise, we need to create a new date column without hours from date column. Then, we need to create "day of week" column, i.e Monday, Tuesday .. or 1, 2 ..,  from that new date column. Total trip count should be found for each day, lastly average total trip should be calculated for each day).

In [21]:
nyc_data_sep.head()

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id
0,2,2015-09-01 01:17:11,2015-09-01 01:23:01,N,1,-73.830284,40.759506,-73.813698,40.751537,2,...,0.0,NaN,0.3,7.80,2,1.0,1,Tuesday,1,2
1,2,2015-09-01 02:01:29,2015-09-01 02:22:58,N,1,-73.955322,40.720055,-73.906677,40.684845,1,...,0.0,NaN,0.3,22.56,1,1.0,2,Tuesday,2,2
2,2,2015-09-01 04:28:56,2015-09-01 04:28:58,N,5,0.000000,0.000000,-73.939354,40.788391,1,...,0.0,NaN,0.0,15.00,1,2.0,4,Tuesday,3,3
3,2,2015-09-01 06:56:55,2015-09-01 06:59:09,N,1,-73.914764,40.763802,-73.921127,40.766788,1,...,0.0,NaN,0.3,5.38,1,1.0,6,Tuesday,4,5
4,2,2015-09-01 07:54:44,2015-09-01 07:57:07,N,1,-73.894241,40.864166,-73.897781,40.870739,1,...,0.0,NaN,0.3,6.24,1,1.0,7,Tuesday,5,2

In [22]:
q = """
        SELECT strftime('%Y%m%d', Lpep_pickup_datetime) as date,
               lpep_pickup_day_of_week,
               count(*)
        FROM nyc_data_sep
        group by date
  
        
        
    """
sqldf(q)

        date lpep_pickup_day_of_week  count(*)
0   20150901                 Tuesday        34
1   20150902               Wednesday        31
2   20150903                Thursday        49
3   20150904                  Friday        63
4   20150905                Saturday        63
5   20150906                  Sunday        58
6   20150907                  Monday        46
7   20150908                 Tuesday        44
8   20150909               Wednesday        41
9   20150910                Thursday        50
10  20150911                  Friday        60
11  20150912                Saturday        66
12  20150913                  Sunday        57
13  20150914                  Monday        36
14  20150915                 Tuesday        36
15  20150916               Wednesday        36
16  20150917                Thursday        50
17  20150918                  Friday        60
18  20150919                Saturday        65
19  20150920                  Sunday        59
20  20150921                  Monday        38
21  20150922                 Tuesday        59
22  20150923               Wednesday        37
23  20150924                Thursday        43
24  20150925                  Friday        57
25  20150926                Saturday        83
26  20150927                  Sunday        46
27  20150928                  Monday        44
28  20150929                 Tuesday        54
29  20150930               Wednesday        35

In [25]:
q = """
      SELECT * 
      FROM
           ( SELECT strftime('%Y%m%d', Lpep_pickup_datetime) as date,
                    lpep_pickup_day_of_week,
                    count(*) as day_trip_count
           FROM nyc_data_sep
           group by date)
  
        
        
    """
sqldf(q)

        date lpep_pickup_day_of_week  day_trip_count
0   20150901                 Tuesday              34
1   20150902               Wednesday              31
2   20150903                Thursday              49
3   20150904                  Friday              63
4   20150905                Saturday              63
5   20150906                  Sunday              58
6   20150907                  Monday              46
7   20150908                 Tuesday              44
8   20150909               Wednesday              41
9   20150910                Thursday              50
10  20150911                  Friday              60
11  20150912                Saturday              66
12  20150913                  Sunday              57
13  20150914                  Monday              36
14  20150915                 Tuesday              36
15  20150916               Wednesday              36
16  20150917                Thursday              50
17  20150918                  Friday              60
18  20150919                Saturday              65
19  20150920                  Sunday              59
20  20150921                  Monday              38
21  20150922                 Tuesday              59
22  20150923               Wednesday              37
23  20150924                Thursday              43
24  20150925                  Friday              57
25  20150926                Saturday              83
26  20150927                  Sunday              46
27  20150928                  Monday              44
28  20150929                 Tuesday              54
29  20150930               Wednesday              35

In [27]:
q = """
      SELECT lpep_pickup_day_of_week,avg(day_trip_count)
      FROM
           ( SELECT strftime('%Y%m%d', Lpep_pickup_datetime) as date,
                    lpep_pickup_day_of_week,
                    count(*) as day_trip_count
           FROM nyc_data_sep
           group by date)
      group by lpep_pickup_day_of_week
        
        
    """
sqldf(q)

  lpep_pickup_day_of_week  avg(day_trip_count)
0                  Friday                60.00
1                  Monday                41.00
2                Saturday                69.25
3                  Sunday                55.00
4                Thursday                48.00
5                 Tuesday                45.40
6               Wednesday                36.00

In [29]:
q = """
      SELECT lpep_pickup_day_of_week,count(*)
      FROM
           ( SELECT strftime('%Y%m%d', Lpep_pickup_datetime) as date,
                    lpep_pickup_day_of_week,
                    count(*) as day_trip_count
           FROM nyc_data_sep
           group by date)
        group by lpep_pickup_day_of_week
  
        
        
    """
sqldf(q)

  lpep_pickup_day_of_week  count(*)
0                  Friday         4
1                  Monday         4
2                Saturday         4
3                  Sunday         4
4                Thursday         4
5                 Tuesday         5
6               Wednesday         5

In [32]:
#case  when ile day_of_week i düzelt
q = """

      SELECT day_of_week,avg(day_trip_count)
                                        
      FROM
           ( SELECT strftime('%Y%m%d', Lpep_pickup_datetime) as date,
                    strftime('%w', Lpep_pickup_datetime) as day_of_week,
                    count(*) as day_trip_count
           FROM nyc_data_sep
           group by date)
      group by day_of_week
        

        
    """
sqldf(q)

  day_of_week  avg(day_trip_count)
0           0                55.00
1           1                41.00
2           2                45.40
3           3                36.00
4           4                48.00
5           5                60.00
6           6                69.25

   8. Count of trips by hour (Luckily, we have hour column. Otherwise, a new hour column should be created from date column, then count trips by hour).

In [39]:
q = """
        SELECT lpep_pickup_hour ,count(*)
        FROM nyc_data_sep
        group by lpep_pickup_hour
  
        
    """
sqldf(q)

    lpep_pickup_hour  count(*)
0                  0        62
1                  1        63
2                  2        31
3                  3        27
4                  4        31
5                  5        11
6                  6        30
7                  7        45
8                  8        63
9                  9        74
10                10        53
11                11        64
12                12        58
13                13        62
14                14        60
15                15        73
16                16        73
17                17        90
18                18       101
19                19        76
20                20        92
21                21        93
22                22        80
23                23        88

In [34]:
nyc_data_sep.columns

Index(['VendorID', 'lpep_pickup_datetime', 'Lpep_dropoff_datetime',
       'Store_and_fwd_flag', 'RateCodeID', 'Pickup_longitude',
       'Pickup_latitude', 'Dropoff_longitude', 'Dropoff_latitude',
       'Passenger_count', 'Trip_distance', 'Fare_amount', 'Extra', 'MTA_tax',
       'Tip_amount', 'Tolls_amount', 'Ehail_fee', 'improvement_surcharge',
       'Total_amount', 'Payment_type', 'Trip_type ', 'lpep_pickup_hour',
       'lpep_pickup_day_of_week', 'trip_id', 'driver_id'],
      dtype='object')

   9. Average passenger count per trip.

In [40]:
q = """
        SELECT avg(Passenger_count)
        FROM nyc_data_sep
      
  
        
    """
sqldf(q)

   avg(Passenger_count)
0              1.328667